updated architecutre
